kylefoxaustin/qemu-imxrt1180/hw/ssi/imxrt1180_flexspi.c
/*
 * NXP i.MX RT1180 FlexSPI controller (serial NOR flash).
 *
 * Copyright (c) 2026, Kyle Fox <kylefoxaustin@github>
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Register offsets, bit positions, LUT opcodes and the LUT unlock key are all
 * taken from the MIMXRT1189 CMSIS header (devices/RT/RT1180/periph/
 * PERI_FLEXSPI.h) and the MCUXpresso fsl_flexspi driver -- not guessed.
 *
 * Two command paths reach the attached SPI-NOR (hw/block/m25p80) over an SSI
 * bus:
 *
 *  - IP commands.  Firmware loads a sequence into the LUT (each seqid is four
 *    32-bit words = eight 16-bit instructions: opcode[15:10], pads[9:8],
 *    operand[7:0]), writes IPCR0 (flash address) and IPCR1 (data size +
 *    sequence id), then triggers IPCMD[TRG].  We interpret the sequence
 *    (CMD/ADDR/MODE/DUMMY/READ/WRITE/STOP), shifting bytes to the flash with
 *    chip-select asserted, filling RFDR on reads and draining TFDR on writes,
 *    and raise INTR[IPCMDDONE].
 *
 *  - AHB reads.  The memory-mapped XIP window issues a normal 03h read for the
 *    accessed offset, so memory-mapped reads return real flash content.
 *
 * The XIP window is READ-ONLY, exactly as on silicon: a CPU store into flash
 * address space does not modify flash.  (Backing that window with plain RAM --
 * which lets guest stores just land -- is a false-green generator: it makes a
 * firmware that programs flash appear to work while hiding whatever the write
 * path actually does.  Erase/program physics -- erase-before-write, bits only
 * 1->0, program-without-erase fails -- come from m25p80, not from us.)
 *
 * WHY THE XIP WINDOW IS A rom_device AND NOT init_io
 * --------------------------------------------------
 * The RT1180 is a crossover MCU: real firmware EXECUTES IN PLACE from this
 * window.  An init_io window is functionally CORRECT -- TCG *can* fetch
 * instructions through MMIO, and an XIP image really does run -- but it is far
 * too slow to live with: an MMIO page's reads cannot be cached, so every
 * instruction fetch becomes a fresh SPI read sequence shifted byte-by-byte over
 * the SSI bus.  Measured, XIP image executing a 3,000,000-iteration loop in
 * place out of the NOR:
 *
 *      init_io AHB window : 25.6 s
 *      rom_device         :  0.22 s        (~116x)
 *
 * So the window is a rom_device: reads and instruction fetches go straight to
 * a RAM mirror (fast, and TCG can cache translations), while stores are routed
 * to our write op and refused.  The m25p80 remains the sole AUTHORITY for flash
 * contents and physics; the mirror is just a coherent, executable view of it,
 * re-synced from the flash after any IP command that modifies it and published
 * with memory_region_flush_rom_device() so stale TBs are invalidated.  This is
 * the same shape hw/block/pflash_cfi01.c uses.
 *
 * PADS ARE NOT MODELLED.  QEMU's SSI bus shifts whole bytes, so 1/2/4/8-pad
 * (SDR) sequences all become the same byte stream; that is fine for NOR command
 * sequences, whose semantics do not depend on lane count.  DDR opcodes are not
 * implemented and are reported (LOG_UNIMP) rather than silently treated as SDR.
 */

#include "qemu/osdep.h"
#include "qemu/log.h"
#include "qemu/module.h"
#include "hw/ssi/imxrt1180_flexspi.h"
#include "hw/core/irq.h"
#include "hw/core/qdev-properties.h"
#include "migration/vmstate.h"

/* --- Register offsets (MIMXRT1189 PERI_FLEXSPI.h) ------------------------- */
#define FSPI_MCR0       0x000
#define FSPI_INTEN      0x010
#define FSPI_INTR       0x014
#define FSPI_LUTKEY     0x018
#define FSPI_LUTCR      0x01c
#define FSPI_IPCR0      0x0a0
#define FSPI_IPCR1      0x0a4
#define FSPI_IPCMD      0x0b0
#define FSPI_IPRXFCR    0x0b8
#define FSPI_IPTXFCR    0x0bc
#define FSPI_STS0       0x0e0
#define FSPI_IPRXFSTS   0x0f0
#define FSPI_IPTXFSTS   0x0f4
#define FSPI_RFDR       0x100   /* 32 words */
#define FSPI_TFDR       0x180   /* 32 words */
#define FSPI_LUT        0x200   /* 128 words -> 32 sequences */
#define FSPI_LUT_END    0x400

/* --- Bit positions -------------------------------------------------------- */
#define MCR0_SWRESET        (1u << 0)

#define INTR_IPCMDDONE      (1u << 0)
#define INTR_IPCMDGE        (1u << 1)   /* IP command grant error */
#define INTR_IPCMDERR       (1u << 3)
#define INTR_IPRXWA         (1u << 5)   /* RX FIFO watermark available */
#define INTR_IPTXWE         (1u << 6)   /* TX FIFO watermark empty     */

#define LUTKEY_VAL          0x5af05af0u
#define LUTCR_LOCK          (1u << 0)
#define LUTCR_UNLOCK        (1u << 1)

#define IPCR1_IDATSZ_MASK   0x0000ffffu
#define IPCR1_ISEQID_SHIFT  16
#define IPCR1_ISEQID_MASK   0x1fu       /* 5 bits: 32 sequences */
#define IPCR1_ISEQNUM_SHIFT 24
#define IPCR1_ISEQNUM_MASK  0x7u

#define IPCMD_TRG           (1u << 0)

#define IPRXFCR_CLRIPRXF    (1u << 0)
#define IPRXFCR_RXWMRK_MASK 0x7cu
#define IPRXFCR_RXWMRK_SHIFT 2

#define IPTXFCR_CLRIPTXF    (1u << 0)

#define STS0_SEQIDLE        (1u << 0)
#define STS0_ARBIDLE        (1u << 1)

#define FSTS_FILL_MASK      0xffu       /* fill level, in 8-byte entries */

/* --- LUT instruction opcodes (fsl_flexspi.h flexspi_command_t) ------------ */
#define LUT_STOP        0x00
#define LUT_CMD_SDR     0x01
#define LUT_RADDR_SDR   0x02
#define LUT_CADDR_SDR   0x03
#define LUT_MODE1_SDR   0x04
#define LUT_MODE2_SDR   0x05
#define LUT_MODE4_SDR   0x06
#define LUT_MODE8_SDR   0x07
#define LUT_WRITE_SDR   0x08
#define LUT_READ_SDR    0x09
#define MCR0_MDIS       0x00000002u  /* FLEXSPI_MCR0_MDIS_MASK: module disabled */
#define LUT_DUMMY_SDR   0x0c
#define LUT_JUMP_ON_CS  0x1f

#define FLASH_CMD_READ  0x03            /* mirror refills use a plain 03h read */

/*
 * Standard JEDEC SPI-NOR erase opcodes.  The controller has no business knowing
 * NOR command semantics -- the m25p80 is the authority and actually performs the
 * erase.  We decode them for ONE reason: to know which span of the executable
 * mirror a sequence just invalidated.  Anything we do not recognise that could
 * have modified flash falls back to re-syncing the whole device (see
 * flexspi_dirty_span), so an unknown command can never leave a stale mirror --
 * it can only be slow.
 */
#define NOR_CMD_ERASE_4K    0x20
#define NOR_CMD_ERASE_32K   0x52
#define NOR_CMD_ERASE_64K   0xd8
#define NOR_CMD_ERASE_CHIP1 0xc7
#define NOR_CMD_ERASE_CHIP2 0x60

static void flexspi_update_irq(IMXRT1180FlexSPIState *s)
{
    uint32_t active = s->regs[FSPI_INTR >> 2] & s->regs[FSPI_INTEN >> 2];

