kylefoxaustin/qemu-imxrt1180/hw/ssi/imxrt1180_flexspi.c
    qemu_set_irq(s->irq, !!active);
}

/* Read `len` bytes at `off` out of the attached flash with a plain 03h read. */
static void flexspi_flash_read(IMXRT1180FlexSPIState *s, uint32_t off,
                               uint8_t *buf, uint32_t len)
{
    uint32_t i;

    qemu_set_irq(s->cs[0], 0);
    ssi_transfer(s->bus, FLASH_CMD_READ);
    ssi_transfer(s->bus, (off >> 16) & 0xff);
    ssi_transfer(s->bus, (off >> 8) & 0xff);
    ssi_transfer(s->bus, off & 0xff);
    for (i = 0; i < len; i++) {
        buf[i] = ssi_transfer(s->bus, 0);
    }
    qemu_set_irq(s->cs[0], 1);
}

/*
 * Re-sync [off, off+len) of the executable mirror from the flash, and publish
 * it: memory_region_flush_rom_device() marks the pages dirty so TCG drops any
 * translation blocks it had cached for code in that range.  Without that a
 * firmware that reprograms code it is about to jump to would execute the OLD
 * bytes -- a silent-wrong.
 */
static void flexspi_sync_mirror(IMXRT1180FlexSPIState *s, uint32_t off,
                                uint32_t len)
{
    uint8_t *mirror;

    if (!s->ahb_size || off >= s->ahb_size) {
        return;             /* no XIP window (e.g. FlexSPI2: no flash on board) */
    }
    len = MIN(len, s->ahb_size - off);

    mirror = memory_region_get_ram_ptr(&s->ahb);
    flexspi_flash_read(s, off, mirror + off, len);
    memory_region_flush_rom_device(&s->ahb, off, len);
}

/*
 * Decide what a just-executed sequence invalidated in the mirror.
 * `wrote` = bytes actually shifted out by a WRITE_SDR, `cmd` = the sequence's
 * command byte, `addr` = IPCR0.  Returns false if flash cannot have changed.
 *
 * Every real way to modify NOR content is covered:
 *   - a program (02h/32h/38h page program, any pad count) SHIFTS DATA, so it is
 *     caught by `wrote` without us having to know its opcode; and
 *   - an erase shifts no data, so it is caught by opcode.
 * A command that neither shifts write data nor is a known erase (WREN, WRDI,
 * status polls, JEDEC id, reads, reset, ...) cannot have changed flash content.
 * WRSR (01h/31h) does shift data but only into the status register, so it
 * re-syncs a couple of harmless bytes rather than being wrongly ignored.
 *
 * A vendor-specific modifying command that shifts no data and is not an erase
 * would be missed -- it is flagged once (LOG_UNIMP) rather than silently
 * tolerated, because a stale executable mirror is a silent-wrong.
 */
static bool flexspi_dirty_span(IMXRT1180FlexSPIState *s, uint8_t cmd,
                               uint32_t addr, uint32_t wrote,
                               uint32_t *off, uint32_t *len)
{
    if (wrote) {                        /* program: exactly what we shifted out */
        *off = addr;
        *len = wrote;
        return true;
    }

    switch (cmd) {
    case NOR_CMD_ERASE_4K:
        *off = addr & ~0xfffu;   *len = 0x1000;   return true;
    case NOR_CMD_ERASE_32K:
        *off = addr & ~0x7fffu;  *len = 0x8000;   return true;
    case NOR_CMD_ERASE_64K:
        *off = addr & ~0xffffu;  *len = 0x10000;  return true;
    case NOR_CMD_ERASE_CHIP1:
    case NOR_CMD_ERASE_CHIP2:
        *off = 0;                *len = s->ahb_size; return true;
    default:
        return false;
    }
}

/* Fill level in 8-byte entries, as IPRXFSTS/IPTXFSTS report it. The FlexSPI
 * FIFOs are 64-bit wide, so a partial entry still counts: fsl_flexspi's small-
 * read path spins on "size > FILL * 8", which would never satisfy a 4-byte
 * read if we truncated instead of rounding up. */
static uint32_t flexspi_fill_entries(Fifo8 *f)
{
    uint32_t entries = (fifo8_num_used(f) + 7) / 8;

    return MIN(entries, FSTS_FILL_MASK);
}

/*
 * Execute one LUT sequence against the flash.
 *
 * Commands run inline (to completion) on the IPCMD[TRG] write.  fsl_flexspi's
 * write path pre-fills the IP TX FIFO *before* triggering (it only streams the
 * remainder afterwards via the TX watermark), and a page program is at most 256
 * bytes against a 1 KiB TX FIFO, so in practice the whole payload is already
 * queued when we run.  If it is not -- a payload larger than the FIFO, which
 * would require true streaming -- we must NOT pad with zeros and silently
 * program the wrong bytes: we report IPCMDERR and log, so the failure is loud.
 */
static void flexspi_run_seq(IMXRT1180FlexSPIState *s, int seqid)
{
    uint32_t addr = s->regs[FSPI_IPCR0 >> 2];
    uint32_t ipcr1 = s->regs[FSPI_IPCR1 >> 2];
    uint32_t datasz = ipcr1 & IPCR1_IDATSZ_MASK;
    uint32_t dirty_off, dirty_len;
    uint32_t wrote = 0;                 /* bytes shifted out by a WRITE_SDR */
    uint8_t cmd_byte = 0;               /* the sequence's command opcode      */
    bool err = false;
    int i;

    qemu_set_irq(s->cs[0], 0);          /* assert chip-select */

    for (i = 0; i < 8; i++) {
        uint32_t word = s->regs[(FSPI_LUT + seqid * 16 + (i / 2) * 4) >> 2];
        uint16_t instr = (i & 1) ? (word >> 16) : (word & 0xffff);
        uint8_t opcode = (instr >> 10) & 0x3f;
        uint8_t operand = instr & 0xff;
        uint32_t n;
        int b;

        switch (opcode) {
        case LUT_STOP:
        case LUT_JUMP_ON_CS:
            i = 8;                      /* end of sequence */
            break;

        case LUT_CMD_SDR:
            cmd_byte = operand;
            ssi_transfer(s->bus, operand);
            break;

        case LUT_RADDR_SDR:
        case LUT_CADDR_SDR:
            /* operand = address width in bits, MSB first */
            for (b = operand / 8 - 1; b >= 0; b--) {
                ssi_transfer(s->bus, (addr >> (b * 8)) & 0xff);
            }
            break;

        case LUT_MODE1_SDR:
        case LUT_MODE2_SDR:
        case LUT_MODE4_SDR:
        case LUT_MODE8_SDR:
            ssi_transfer(s->bus, operand);
            break;

        case LUT_DUMMY_SDR:
            /* operand = dummy cycles; the SSI bus shifts whole bytes. */
            for (n = 0; n < (operand + 7u) / 8u; n++) {
                ssi_transfer(s->bus, 0);
            }
            break;

        case LUT_READ_SDR:
            for (n = 0; n < datasz; n++) {
                uint8_t rx = ssi_transfer(s->bus, 0);

                if (fifo8_is_full(&s->rx)) {
                    qemu_log_mask(LOG_GUEST_ERROR, "%s: IP RX FIFO overflow "
                                  "(datasz %u > %u) - read truncated\n",
                                  __func__, datasz,
                                  IMXRT1180_FLEXSPI_FIFO_BYTES);
                    err = true;
                    break;
                }
                fifo8_push(&s->rx, rx);
            }
            break;

        case LUT_WRITE_SDR:
            for (n = 0; n < datasz; n++) {
                if (fifo8_is_empty(&s->tx)) {
                    /*
                     * Firmware asked us to program more bytes than it queued.
                     * Padding with zeros here would silently write the wrong
                     * data to flash -- fail loudly instead.
                     */
                    qemu_log_mask(LOG_GUEST_ERROR, "%s: IP TX FIFO underrun "
                                  "at byte %u of %u - refusing to program "
                                  "padding (streaming writes larger than the "
                                  "%u-byte FIFO are not modelled)\n",
                                  __func__, n, datasz,
                                  IMXRT1180_FLEXSPI_FIFO_BYTES);
                    err = true;
                    break;
                }
                ssi_transfer(s->bus, fifo8_pop(&s->tx));
                wrote++;
            }
            break;

        default:
            qemu_log_mask(LOG_UNIMP, "%s: LUT opcode 0x%02x (seq %d, slot %d) "
                          "not implemented\n", __func__, opcode, seqid, i);
            err = true;
            break;
        }
    }

    qemu_set_irq(s->cs[0], 1);          /* deassert chip-select */

