kylefoxaustin/qemu-imxrt1180/hw/ssi/imxrt1180_flexspi.c
    /*
     * If that sequence changed flash content, refresh the executable XIP mirror
     * for the span it touched.  The flash (m25p80) stays the authority; this
     * only republishes what it now holds, and invalidates any TBs TCG had
     * cached for code in that span.
     */
    if (flexspi_dirty_span(s, cmd_byte, addr, wrote, &dirty_off, &dirty_len)) {
        flexspi_sync_mirror(s, dirty_off, dirty_len);
    }

    s->regs[FSPI_INTR >> 2] |= INTR_IPCMDDONE | (err ? INTR_IPCMDERR : 0);
    flexspi_update_irq(s);
}

/* Raw NOR helpers used to "flash the board" at load time (see below). */
#define NOR_CMD_WREN        0x06
#define NOR_CMD_PAGE_PROG   0x02
#define NOR_SECTOR_SIZE     0x1000
#define NOR_PAGE_SIZE       0x100

static void flexspi_nor_cmd_addr(IMXRT1180FlexSPIState *s, uint8_t cmd,
                                 uint32_t addr, const uint8_t *data,
                                 uint32_t len)
{
    uint32_t i;

    qemu_set_irq(s->cs[0], 0);
    ssi_transfer(s->bus, NOR_CMD_WREN);
    qemu_set_irq(s->cs[0], 1);

    qemu_set_irq(s->cs[0], 0);
    ssi_transfer(s->bus, cmd);
    ssi_transfer(s->bus, (addr >> 16) & 0xff);
    ssi_transfer(s->bus, (addr >> 8) & 0xff);
    ssi_transfer(s->bus, addr & 0xff);
    for (i = 0; i < len; i++) {
        ssi_transfer(s->bus, data[i]);
    }
    qemu_set_irq(s->cs[0], 1);
}

/*
 * Program `len` bytes at `off` into the attached NOR -- i.e. FLASH THE BOARD.
 *
 * `-kernel` with an image linked into the XIP window means "this firmware is in
 * the board's NOR flash", so the NOR must actually contain it.  Writing only the
 * executable mirror would leave the mirror and the flash disagreeing: the first
 * erase (or the reset re-sync, which refills the mirror FROM the flash) would
 * silently resurrect the old content underneath a running image.  So we do a
 * real read/erase/program cycle through the flash model, which also means the
 * loaded image obeys the same NOR physics as anything the guest programs.
 *
 * Read-modify-write per 4 KiB sector, so several ELF segments landing in one
 * sector do not erase each other.
 */
void imxrt1180_flexspi_flash_program(IMXRT1180FlexSPIState *s, uint32_t off,
                                     const uint8_t *buf, uint32_t len)
{
    g_autofree uint8_t *sector = g_malloc(NOR_SECTOR_SIZE);
    uint32_t first = off & ~(NOR_SECTOR_SIZE - 1);
    uint32_t last  = (off + len - 1) & ~(NOR_SECTOR_SIZE - 1);
    uint32_t sec;

    if (!len || !s->ahb_size) {
        return;
    }

    for (sec = first; sec <= last; sec += NOR_SECTOR_SIZE) {
        uint32_t p;
        /* 1. read what the sector holds today */
        flexspi_flash_read(s, sec, sector, NOR_SECTOR_SIZE);

        /* 2. overlay the part of the image that lands in this sector */
        for (p = 0; p < NOR_SECTOR_SIZE; p++) {
            uint32_t a = sec + p;
            if (a >= off && a < off + len) {
                sector[p] = buf[a - off];
            }
        }

        /* 3. erase, then page-program the merged sector back */
        flexspi_nor_cmd_addr(s, NOR_CMD_ERASE_4K, sec, NULL, 0);
        for (p = 0; p < NOR_SECTOR_SIZE; p += NOR_PAGE_SIZE) {
            flexspi_nor_cmd_addr(s, NOR_CMD_PAGE_PROG, sec + p,
                                 sector + p, NOR_PAGE_SIZE);
        }
    }

    /* Republish the affected span into the executable mirror. */
    flexspi_sync_mirror(s, first, last - first + NOR_SECTOR_SIZE);
}

static uint64_t flexspi_read(void *opaque, hwaddr offset, unsigned size)
{
    IMXRT1180FlexSPIState *s = opaque;

    /* IP RX FIFO data: any word in the RFDR aperture pops 4 bytes. */
    if (offset >= FSPI_RFDR && offset < FSPI_RFDR + 0x80) {
        uint32_t word = 0;
        int b;

        for (b = 0; b < 4; b++) {       /* RFDR packs 4 bytes, LSB first */
            if (!fifo8_is_empty(&s->rx)) {
                word |= (uint32_t)fifo8_pop(&s->rx) << (b * 8);
            }
        }
        return word;
    }

    switch (offset) {
    case FSPI_STS0:
        /*
         * Commands complete inline, so the arbiter is always idle (ARBIDLE).  But
         * SEQIDLE reports the SEQUENCE ENGINE, and while the module is DISABLED
         * (MCR0.MDIS, which is SET at reset -- MCR0 resets to 0xFFFF80C2) the engine
         * is not clocked and does not report itself idle.  The RM resets STS0 to
         * 0x2: ARBIDLE alone.
         *
         *   WE REPORTED AN IDLE SEQUENCE ENGINE FROM A MODULE THAT WAS SWITCHED OFF.
         */
        return STS0_ARBIDLE |
               ((s->regs[FSPI_MCR0 >> 2] & MCR0_MDIS) ? 0 : STS0_SEQIDLE);

    case FSPI_IPRXFSTS:
        return flexspi_fill_entries(&s->rx);

    case FSPI_IPTXFSTS:
        return flexspi_fill_entries(&s->tx);

    case FSPI_INTR: {
        /*
         * Commands complete inline, so the IP FIFOs are never a bottleneck:
         * TX always has room (IPTXWE), and RX reports watermark-available once
         * it holds at least a watermark's worth.  Without these the fsl_flexspi
         * per-chunk polls never retire.
         */
        uint32_t rxwmrk =
            ((s->regs[FSPI_IPRXFCR >> 2] & IPRXFCR_RXWMRK_MASK)
             >> IPRXFCR_RXWMRK_SHIFT) + 1;
        uint32_t intr = s->regs[FSPI_INTR >> 2];

        /* A DISABLED module raises no flags.  MCR0.MDIS is SET at reset, and the RM
         * resets INTR to 0 -- we were asserting IPTXWE from a switched-off block. */
        if (s->regs[FSPI_MCR0 >> 2] & MCR0_MDIS) {
            return intr;
        }
        intr |= INTR_IPTXWE;
        if (fifo8_num_used(&s->rx) >= rxwmrk * 8) {
            intr |= INTR_IPRXWA;
        }
        return intr;
    }

    default:
        if ((offset >> 2) >= IMXRT1180_FLEXSPI_NUM_REGS) {
            return 0;
        }
        return s->regs[offset >> 2];
    }
}

static void flexspi_write(void *opaque, hwaddr offset, uint64_t value,
                          unsigned size)
{
    IMXRT1180FlexSPIState *s = opaque;

    /* IP TX FIFO data: any word in the TFDR aperture pushes 4 bytes. */
    if (offset >= FSPI_TFDR && offset < FSPI_TFDR + 0x80) {
        int b;

        for (b = 0; b < 4; b++) {       /* TFDR unpacks 4 bytes, LSB first */
            if (fifo8_is_full(&s->tx)) {
                qemu_log_mask(LOG_GUEST_ERROR,
                              "%s: IP TX FIFO overflow - byte dropped\n",
                              __func__);
                break;
            }
            fifo8_push(&s->tx, (value >> (b * 8)) & 0xff);
        }
        return;
    }

    if (offset >= FSPI_LUT && offset < FSPI_LUT_END) {
        if (s->lut_unlocked) {
            s->regs[offset >> 2] = value;
        } else {
            qemu_log_mask(LOG_GUEST_ERROR,
                          "%s: LUT write @0x%" HWADDR_PRIx " while locked\n",
                          __func__, offset);
        }
        return;
    }

    switch (offset) {
    case FSPI_MCR0:
        if (value & MCR0_SWRESET) {
            fifo8_reset(&s->rx);
            fifo8_reset(&s->tx);
            value &= ~MCR0_SWRESET;     /* self-clearing */
        }
        s->regs[FSPI_MCR0 >> 2] = value;
        break;

    case FSPI_LUTCR:
        /* Unlock needs the key in LUTKEY first; LUTCR=2 unlock, =1 lock. */
        if ((value & LUTCR_UNLOCK) &&
            s->regs[FSPI_LUTKEY >> 2] == LUTKEY_VAL) {
            s->lut_unlocked = true;
        } else if (value & LUTCR_LOCK) {
            s->lut_unlocked = false;
        }
        s->regs[FSPI_LUTCR >> 2] = value;
        break;

    case FSPI_INTR:
        s->regs[FSPI_INTR >> 2] &= ~(uint32_t)value;    /* write-1-to-clear */
        flexspi_update_irq(s);
        break;

    case FSPI_IPRXFCR:
        if (value & IPRXFCR_CLRIPRXF) {
            fifo8_reset(&s->rx);
        }
        /* Keep RXWMRK: the driver reads it back to size its FIFO polls. */
        s->regs[FSPI_IPRXFCR >> 2] = value & ~IPRXFCR_CLRIPRXF;
        break;

