kylefoxaustin/qemu-imxrt1180/hw/ssi/imxrt1180_flexspi.c
    case FSPI_IPTXFCR:
        if (value & IPTXFCR_CLRIPTXF) {
            fifo8_reset(&s->tx);
        }
        s->regs[FSPI_IPTXFCR >> 2] = value & ~IPTXFCR_CLRIPTXF;
        break;

    case FSPI_IPCMD:
        if (value & IPCMD_TRG) {
            uint32_t ipcr1 = s->regs[FSPI_IPCR1 >> 2];
            int seqid = (ipcr1 >> IPCR1_ISEQID_SHIFT) & IPCR1_ISEQID_MASK;
            uint32_t seqnum =
                (ipcr1 >> IPCR1_ISEQNUM_SHIFT) & IPCR1_ISEQNUM_MASK;

            if (seqnum != 0) {
                qemu_log_mask(LOG_UNIMP, "%s: IPCR1[ISEQNUM]=%u (multi-sequence "
                              "IP command) not modelled; running seq %d only\n",
                              __func__, seqnum, seqid);
            }
            flexspi_run_seq(s, seqid);
        }
        break;

    default:
        if ((offset >> 2) < IMXRT1180_FLEXSPI_NUM_REGS) {
            s->regs[offset >> 2] = value;
        }
        break;
    }
}

static const MemoryRegionOps flexspi_ops = {
    .read = flexspi_read,
    .write = flexspi_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = { .min_access_size = 4, .max_access_size = 4 },
};

/* --- AHB-mapped flash (XIP) window ---------------------------------------- */

static uint64_t flexspi_ahb_read(void *opaque, hwaddr offset, unsigned size)
{
    IMXRT1180FlexSPIState *s = opaque;
    uint64_t val = 0;
    unsigned b;

    qemu_set_irq(s->cs[0], 0);
    ssi_transfer(s->bus, FLASH_CMD_READ);
    for (b = 3; b-- > 0; ) {            /* 24-bit address, MSB first */
        ssi_transfer(s->bus, (offset >> (b * 8)) & 0xff);
    }
    for (b = 0; b < size; b++) {
        val |= (uint64_t)ssi_transfer(s->bus, 0) << (b * 8);
    }
    qemu_set_irq(s->cs[0], 1);

    return val;
}

static void flexspi_ahb_write(void *opaque, hwaddr offset, uint64_t value,
                              unsigned size)
{
    /*
     * The XIP window is read-only on silicon -- a CPU store into flash address
     * space does not modify flash.  Programming goes through the IP command
     * path.  Log it: firmware storing here is a bug in the firmware (or a
     * .bss/.data section mislinked into flash), and quietly absorbing the write
     * would hide it.
     */
    qemu_log_mask(LOG_GUEST_ERROR,
                  "imxrt1180-flexspi: store to read-only XIP window "
                  "@0x%" HWADDR_PRIx " (value 0x%" PRIx64 ") ignored; flash is "
                  "programmed via the IP command path\n", offset, value);
}

static const MemoryRegionOps flexspi_ahb_ops = {
    .read = flexspi_ahb_read,           /* only used if romd mode is ever off */
    .write = flexspi_ahb_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = { .min_access_size = 1, .max_access_size = 8 },
    .impl = { .min_access_size = 1, .max_access_size = 8 },
};

static void flexspi_reset(DeviceState *dev)
{
    IMXRT1180FlexSPIState *s = IMXRT1180_FLEXSPI(dev);

    memset(s->regs, 0, sizeof(s->regs));

    /*
     * FlexSPI reset values -- offsets from PERI_FLEXSPI.h, values from the RM's
     * cold-POR column.  MCR0 (0xFFFF80C2) is the one that matters: FLEXSPI_Init
     * READ-MODIFY-WRITES it (mask in a field, write back), so a zeroed MCR0 launders
     * our lie into the controller configuration the guest then runs with -- and the
     * top 16 bits are the AHB/IP grant timeout counters, which reset to ALL-ONES.
     *
     * LUTKEY (0x5AF05AF0) is the key value the driver compares against before it
     * will unlock the LUT.
     */
    s->regs[0x00 / 4] = 0xFFFF80C2;   /* MCR0    */
    s->regs[0x04 / 4] = 0xFFFFFFFF;   /* MCR1    */
    s->regs[0x08 / 4] = 0x200081F7;   /* MCR2    */
    s->regs[0x0C / 4] = 0x00000018;   /* AHBCR   */
    s->regs[0x18 / 4] = 0x5AF05AF0;   /* LUTKEY  */
    s->regs[0x1C / 4] = 0x00000002;   /* LUTCR   */
    s->regs[0x94 / 4] = 0x000000C3;   /* FLSHCR4 */
    s->regs[0xE0 / 4] = 0x00000002;   /* STS0    */
    s->regs[0xE8 / 4] = 0x01000100;   /* STS2    */

    s->lut_unlocked = false;
    fifo8_reset(&s->rx);
    fifo8_reset(&s->tx);

    /*
     * Populate the executable XIP mirror from the flash.  This runs at reset,
     * not realize, because the m25p80 is only attached to our SSI bus after we
     * are realized -- at realize the bus is still empty and every read would
     * return zeros (a mirror full of plausible nothing).
     */
    flexspi_sync_mirror(s, 0, s->ahb_size);
}

static void flexspi_realize(DeviceState *dev, Error **errp)
{
    IMXRT1180FlexSPIState *s = IMXRT1180_FLEXSPI(dev);

    s->bus = ssi_create_bus(dev, "spi");
    qdev_init_gpio_out_named(dev, s->cs, "cs", IMXRT1180_FLEXSPI_NUM_CS);
    fifo8_create(&s->rx, IMXRT1180_FLEXSPI_FIFO_BYTES);
    fifo8_create(&s->tx, IMXRT1180_FLEXSPI_FIFO_BYTES);

    memory_region_init_io(&s->iomem, OBJECT(dev), &flexspi_ops, s,
                          TYPE_IMXRT1180_FLEXSPI, IMXRT1180_FLEXSPI_REG_SIZE);
    sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->iomem);

    if (s->ahb_size) {
        /*
         * rom_device, NOT init_io: reads and INSTRUCTION FETCHES go straight to
         * the RAM mirror (so XIP is fast and TCG can cache translations), while
         * stores are routed to flexspi_ahb_write and refused.  See the file
         * header for why an init_io window, though functional, is unusable here.
         */
        if (!memory_region_init_rom_device(&s->ahb, OBJECT(dev),
                                           &flexspi_ahb_ops, s,
                                           "imxrt1180-flexspi-ahb",
                                           s->ahb_size, errp)) {
            return;
        }
        sysbus_init_mmio(SYS_BUS_DEVICE(dev), &s->ahb);
    }
    sysbus_init_irq(SYS_BUS_DEVICE(dev), &s->irq);
}

static const Property flexspi_properties[] = {
    DEFINE_PROP_UINT32("ahb-size", IMXRT1180FlexSPIState, ahb_size,
                       0x01000000),     /* 16 MiB: the EVK's FlexSPI1 A1 NOR */
};

static const VMStateDescription vmstate_flexspi = {
    .name = TYPE_IMXRT1180_FLEXSPI,
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32_ARRAY(regs, IMXRT1180FlexSPIState,
                             IMXRT1180_FLEXSPI_NUM_REGS),
        VMSTATE_BOOL(lut_unlocked, IMXRT1180FlexSPIState),
        VMSTATE_FIFO8(rx, IMXRT1180FlexSPIState),
        VMSTATE_FIFO8(tx, IMXRT1180FlexSPIState),
        VMSTATE_END_OF_LIST()
    },
};

static void flexspi_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = flexspi_realize;
    dc->vmsd = &vmstate_flexspi;
    device_class_set_legacy_reset(dc, flexspi_reset);
    device_class_set_props(dc, flexspi_properties);
    dc->desc = "i.MX RT1180 FlexSPI controller";
}

static const TypeInfo flexspi_types[] = {
    {
        .name          = TYPE_IMXRT1180_FLEXSPI,
        .parent        = TYPE_SYS_BUS_DEVICE,
        .instance_size = sizeof(IMXRT1180FlexSPIState),
        .class_init    = flexspi_class_init,
    },
};

DEFINE_TYPES(flexspi_types)
